```
DataFrame students
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| student_id  | int    |
| name        | object |
| age         | int    |
| grade       | float  |
+-------------+--------+
Write a solution to correct the errors:

The grade column is stored as floats, convert it to integers.

The result format is in the following example.



Example 1:
Input:
DataFrame students:
+------------+------+-----+-------+
| student_id | name | age | grade |
+------------+------+-----+-------+
| 1          | Ava  | 6   | 73.0  |
| 2          | Kate | 15  | 87.0  |
+------------+------+-----+-------+
Output:
+------------+------+-----+-------+
| student_id | name | age | grade |
+------------+------+-----+-------+
| 1          | Ava  | 6   | 73    |
| 2          | Kate | 15  | 87    |
+------------+------+-----+-------+
Explanation:
The data types of the column grade is converted to int.
```

In [1]:
import pandas as pd

## Test Case

In [2]:
data = [
    {"student_id": 1, "name": "Ava",  "age": 6,  "grade": 73},
    {"student_id": 2, "name": "Kate", "age": 15, "grade": 87},
]

df = pd.DataFrame(data)

## My Submission

In [3]:
def change_data_type(students: pd.DataFrame) -> pd.DataFrame:
    students["grade"] = students["grade"].astype(int)
    return students

change_data_type(df)

   student_id  name  age  grade
0           1   Ava    6     73
1           2  Kate   15     87